devdnl/dnx-rtos/src/system/drivers/irq/stm32f1/irq.c
                        return STD_RET_OK;
                }
        }

        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Release device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_RELEASE(IRQ, void *device_handle)
{
        IRQ_t *hdl = device_handle;

        _sys_critical_section_begin();

        for (uint i = 0; i < NUMBER_OF_IRQs; i++) {
                disable_EXTI_IRQ(i);

                if (hdl->irqsem[i]) {
                        _sys_semaphore_delete(hdl->irqsem[i]);
                        hdl->irqsem[i] = NULL;
                }
        }

        free(hdl);
        IRQ = NULL;

        _sys_critical_section_end();

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Open device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           flags                  file operation flags (O_RDONLY, O_WRONLY, O_RDWR)
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_OPEN(IRQ, void *device_handle, u32_t flags)
{
        UNUSED_ARG(device_handle);
        UNUSED_ARG(flags);

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Close device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           force                  device force close (true)
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_CLOSE(IRQ, void *device_handle, bool force)
{
        UNUSED_ARG(device_handle);
        UNUSED_ARG(force);

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Write data to device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]          *src                    data source
 * @param[in ]           count                  number of bytes to write
 * @param[in ][out]     *fpos                   file position
 * @param[in ]           fattr                  file attributes
 *
 * @return number of written bytes, -1 if error
 */
//==============================================================================
API_MOD_WRITE(IRQ, void *device_handle, const u8_t *src, size_t count, fpos_t *fpos, struct vfs_fattr fattr)
{
        UNUSED_ARG(device_handle);
        UNUSED_ARG(src);
        UNUSED_ARG(count);
        UNUSED_ARG(fpos);
        UNUSED_ARG(fattr);

        errno = EPERM;

        return 0;
}

//==============================================================================
/**
 * @brief Read data from device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *dst                    data destination
 * @param[in ]           count                  number of bytes to read
 * @param[in ][out]     *fpos                   file position
 * @param[in ]           fattr                  file attributes
 *
 * @return number of read bytes, -1 if error
 */
//==============================================================================
API_MOD_READ(IRQ, void *device_handle, u8_t *dst, size_t count, fpos_t *fpos, struct vfs_fattr fattr)
{
        UNUSED_ARG(device_handle);
        UNUSED_ARG(dst);
        UNUSED_ARG(count);
        UNUSED_ARG(fpos);
        UNUSED_ARG(fattr);

        errno = EPERM;

        return 0;
}

//==============================================================================
/**
 * @brief IO control
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @return On success return 0 or 1. On error, -1 is returned, and errno set
 *         appropriately.
 */
//==============================================================================
API_MOD_IOCTL(IRQ, void *device_handle, int request, void *arg)
{
        UNUSED_ARG(device_handle);

        IRQ_t *hdl = device_handle;

        if (arg) {
                switch (request) {
                case IOCTL_IRQ__CATCH: {
                        const IRQ_catch_t *irqn = arg;
                        if (irqn->irq_number < NUMBER_OF_IRQs) {
                                if (hdl->irqsem[irqn->irq_number]) {
                                        return _sys_semaphore_wait(hdl->irqsem[irqn->irq_number], irqn->timeout);
                                }
                        }

                        break;
                }

                case IOCTL_IRQ__TRIGGER: {
                        const int irqn = (int)arg;
                        if (irqn < NUMBER_OF_IRQs) {
                                WRITE_REG(EXTI->SWIER, EXTI_SWIER_SWIER0 << irqn);
                                return 0;
                        }

                        break;
                }

                case IOCTL_IRQ__CONFIGURE: {
                        const IRQ_config_t *cfg = arg;
                        if (cfg->irq_number < NUMBER_OF_IRQs) {
                                if (cfg->mode == IRQ_CONFIG_MODE__IRQ_DISABLED) {
                                        disable_EXTI_IRQ(cfg->irq_number);

                                        if (hdl->irqsem[cfg->irq_number]) {
                                                _sys_semaphore_delete(hdl->irqsem[cfg->irq_number]);
                                                hdl->irqsem[cfg->irq_number] = NULL;
                                        }
                                } else {
                                        if (hdl->irqsem[cfg->irq_number] == NULL) {
                                                hdl->irqsem[cfg->irq_number] = _sys_semaphore_new(1, 0);
                                                if (hdl->irqsem[cfg->irq_number] == NULL)
                                                        break;
                                        }

                                        bool falling, rising;
                                        if (cfg->mode == IRQ_CONFIG_MODE__TRIGGER_ON_FALLING_EDGE) {
                                                falling = true;
                                                rising  = false;
                                        } else if (cfg->mode == IRQ_CONFIG_MODE__TRIGGER_ON_RISING_EDGE) {
                                                falling = false;
                                                rising  = true;
                                        } else if (cfg->mode == IRQ_CONFIG_MODE__TRIGGER_ON_FALLING_AND_RISING_EDGE) {
                                                falling = true;
                                                rising  = true;
                                        } else {
                                                falling = false;
                                                rising  = false;
                                        }

                                        set_EXTI_edge_detector(cfg->irq_number, falling, rising);
                                        enable_EXTI_IRQ(cfg->irq_number);
                                }

